```data.archive_file.app_zip: Reading...
data.archive_file.libs_zip: Reading...
data.archive_file.app_zip: Read complete after 0s [id=b4f1ff1a8dece0ed59221194a68b3b06d8e77933]
data.aws_caller_identity.current: Reading...
aws_iam_role.LambdaExecRole: Refreshing state... [id=throwtrash-lambda-role-ap-northeast-1]
data.aws_region.current: Reading...
aws_s3_bucket_acl.PreferenceBucketAcl: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1,private]
aws_s3_bucket.RequestLogBucket: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1]
aws_s3_bucket_acl.RequestLogBucketAcl: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1,private]
aws_s3_bucket.PreferenceBucket: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1]
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.archive_file.libs_zip: Read complete after 2s [id=c26e998d885f33b5b5497a63941e01d92b7cb38f]
aws_lambda_layer_version.Layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17]
aws_lambda_function.ThrowTrashSkill: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill]
aws_lambda_permission.LambdaEvent: Refreshing state... [id=AllowExecutionFromAlexa]
aws_iam_policy.LambdaExecPolicy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-lambda-policy-ap-northeast-1]
aws_iam_role_policy_attachment.LambdaRolePolicyAttachment: Refreshing state... [id=throwtrash-lambda-role-ap-northeast-1-20240108150229331600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.LambdaExecPolicy must be replaced
-/+ resource "aws_iam_policy" "LambdaExecPolicy" {
      ~ arn         = "arn:aws:iam::188970983837:policy/throwtrash-lambda-policy-ap-northeast-1" -> (known after apply)
      ~ id          = "arn:aws:iam::188970983837:policy/throwtrash-lambda-policy-ap-northeast-1" -> (known after apply)
      ~ name        = "throwtrash-lambda-policy-ap-northeast-1" -> "throwtrash-skill-lambda-policy" # forces replacement
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-schedule",
                          - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-accesstoken",
                        ]
                    },
                  - {
                      - Action   = "lambda:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1",
                          - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1/*",
                          - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1",
                          - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPASX74MMGOSBBVU6MHK" -> (known after apply)
        tags        = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.LambdaExecRole must be replaced
-/+ resource "aws_iam_role" "LambdaExecRole" {
      ~ arn                   = "arn:aws:iam::188970983837:role/throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2019-11-24T06:26:17Z" -> (known after apply)
      ~ id                    = "throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "throwtrash-lambda-role-ap-northeast-1" -> "throwtrash-skill-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      ~ unique_id             = "AROASX74MMGOZANNJ4RBW" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "throwtrash-lambda-policy-ap-northeast-1" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "dynamodb:*"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/TrashSchedule",
                              - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-backend-accesstoken",
                            ]
                        },
                      - {
                          - Action   = "lambda:*"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill",
                            ]
                        },
                      - {
                          - Action   = [
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:PutObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1",
                              - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1/*",
                              - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1",
                              - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy_attachment.LambdaRolePolicyAttachment will be created
  + resource "aws_iam_role_policy_attachment" "LambdaRolePolicyAttachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "throwtrash-skill-lambda-role"
    }

  # aws_lambda_function.ThrowTrashSkill must be replaced
-/+ resource "aws_lambda_function" "ThrowTrashSkill" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> (known after apply)
      ~ function_name                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> "ThrowTrashSkill" # forces replacement
      ~ id                             = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill/invocations" -> (known after apply)
      ~ last_modified                  = "2024-01-08T14:48:31.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill:30" -> (known after apply)
      ~ role                           = "arn:aws:iam::188970983837:role/throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 15215 -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      ~ version                        = "30" -> (known after apply)
        # (14 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_REGION"          = "ap-northeast-1" -> null
                # (5 unchanged elements hidden)
            }
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_layer_version.Layer must be replaced
-/+ resource "aws_lambda_layer_version" "Layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-01-08T12:50:41.899+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "uBk22tAW9qb+jYZTptAA5R1wp1bz3vcappNF0VIE438=" -> "xBSHWJ0FvhBV/Uego9xkgy0yKp+y1bp8o79y/XTHkPU=" # forces replacement
      ~ source_code_size            = 20750056 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_lambda_permission.LambdaEvent must be replaced
-/+ resource "aws_lambda_permission" "LambdaEvent" {
      ~ function_name      = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> "ThrowTrashSkill" # forces replacement
      ~ id                 = "AllowExecutionFromAlexa" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket.PreferenceBucket must be replaced
-/+ resource "aws_s3_bucket" "PreferenceBucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1" -> (known after apply)
      ~ bucket                      = "throwtrash-skill-preference-ap-northeast-1" -> "throwtrash-skill-preference-prod" # forces replacement
      ~ bucket_domain_name          = "throwtrash-skill-preference-ap-northeast-1.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "throwtrash-skill-preference-ap-northeast-1.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "throwtrash-skill-preference-ap-northeast-1" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      ~ object_lock_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.RequestLogBucket must be replaced
-/+ resource "aws_s3_bucket" "RequestLogBucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1" -> (known after apply)
      ~ bucket                      = "throwtrash-skill-request-logs-ap-northeast-1" -> "throwtrash-skill-request-logs-prod" # forces replacement
      ~ bucket_domain_name          = "throwtrash-skill-request-logs-ap-northeast-1.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "throwtrash-skill-request-logs-ap-northeast-1.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "throwtrash-skill-request-logs-ap-northeast-1" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "delete-expired-error-logs" -> null
          - prefix                                 = "error/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "delete-expired-request-logs" -> null
          - prefix                                 = "request/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ object_lock_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_acl.PreferenceBucketAcl will be destroyed
  # (because aws_s3_bucket_acl.PreferenceBucketAcl is not in configuration)
  - resource "aws_s3_bucket_acl" "PreferenceBucketAcl" {
      - acl                   = "private" -> null
      - bucket                = "throwtrash-skill-preference-ap-northeast-1" -> null
      - id                    = "throwtrash-skill-preference-ap-northeast-1,private" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "takahikoyamada2000" -> null
                  - id            = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "takahikoyamada2000" -> null
              - id           = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
            }
        }
    }

  # aws_s3_bucket_acl.RequestLogBucketAcl will be destroyed
  # (because aws_s3_bucket_acl.RequestLogBucketAcl is not in configuration)
  - resource "aws_s3_bucket_acl" "RequestLogBucketAcl" {
      - acl                   = "private" -> null
      - bucket                = "throwtrash-skill-request-logs-ap-northeast-1" -> null
      - id                    = "throwtrash-skill-request-logs-ap-northeast-1,private" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "takahikoyamada2000" -> null
                  - id            = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "takahikoyamada2000" -> null
              - id           = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
            }
        }
    }

Plan: 8 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
stdout<<ghadelimiter_6441a2cb-345c-4fc1-b172-233a148bdb48
data.archive_file.app_zip: Reading...
data.archive_file.libs_zip: Reading...
data.archive_file.app_zip: Read complete after 0s [id=b4f1ff1a8dece0ed59221194a68b3b06d8e77933]
data.aws_caller_identity.current: Reading...
aws_iam_role.LambdaExecRole: Refreshing state... [id=throwtrash-lambda-role-ap-northeast-1]
data.aws_region.current: Reading...
aws_s3_bucket_acl.PreferenceBucketAcl: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1,private]
aws_s3_bucket.RequestLogBucket: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1]
aws_s3_bucket_acl.RequestLogBucketAcl: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1,private]
aws_s3_bucket.PreferenceBucket: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1]
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.archive_file.libs_zip: Read complete after 2s [id=c26e998d885f33b5b5497a63941e01d92b7cb38f]
aws_lambda_layer_version.Layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17]
aws_lambda_function.ThrowTrashSkill: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill]
aws_lambda_permission.LambdaEvent: Refreshing state... [id=AllowExecutionFromAlexa]
aws_iam_policy.LambdaExecPolicy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-lambda-policy-ap-northeast-1]
aws_iam_role_policy_attachment.LambdaRolePolicyAttachment: Refreshing state... [id=throwtrash-lambda-role-ap-northeast-1-20240108150229331600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.LambdaExecPolicy must be replaced
-/+ resource "aws_iam_policy" "LambdaExecPolicy" {
      ~ arn         = "arn:aws:iam::188970983837:policy/throwtrash-lambda-policy-ap-northeast-1" -> (known after apply)
      ~ id          = "arn:aws:iam::188970983837:policy/throwtrash-lambda-policy-ap-northeast-1" -> (known after apply)
      ~ name        = "throwtrash-lambda-policy-ap-northeast-1" -> "throwtrash-skill-lambda-policy" # forces replacement
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-schedule",
                          - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-accesstoken",
                        ]
                    },
                  - {
                      - Action   = "lambda:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1",
                          - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1/*",
                          - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1",
                          - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPASX74MMGOSBBVU6MHK" -> (known after apply)
        tags        = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.LambdaExecRole must be replaced
-/+ resource "aws_iam_role" "LambdaExecRole" {
      ~ arn                   = "arn:aws:iam::188970983837:role/throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2019-11-24T06:26:17Z" -> (known after apply)
      ~ id                    = "throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "throwtrash-lambda-role-ap-northeast-1" -> "throwtrash-skill-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      ~ unique_id             = "AROASX74MMGOZANNJ4RBW" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "throwtrash-lambda-policy-ap-northeast-1" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "dynamodb:*"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/TrashSchedule",
                              - "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-backend-accesstoken",
                            ]
                        },
                      - {
                          - Action   = "lambda:*"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill",
                            ]
                        },
                      - {
                          - Action   = [
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:PutObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1",
                              - "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1/*",
                              - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1",
                              - "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy_attachment.LambdaRolePolicyAttachment will be created
  + resource "aws_iam_role_policy_attachment" "LambdaRolePolicyAttachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "throwtrash-skill-lambda-role"
    }

  # aws_lambda_function.ThrowTrashSkill must be replaced
-/+ resource "aws_lambda_function" "ThrowTrashSkill" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> (known after apply)
      ~ function_name                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> "ThrowTrashSkill" # forces replacement
      ~ id                             = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill/invocations" -> (known after apply)
      ~ last_modified                  = "2024-01-08T14:48:31.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill:30" -> (known after apply)
      ~ role                           = "arn:aws:iam::188970983837:role/throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 15215 -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      ~ version                        = "30" -> (known after apply)
        # (14 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_REGION"          = "ap-northeast-1" -> null
                # (5 unchanged elements hidden)
            }
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_layer_version.Layer must be replaced
-/+ resource "aws_lambda_layer_version" "Layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-01-08T12:50:41.899+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "uBk22tAW9qb+jYZTptAA5R1wp1bz3vcappNF0VIE438=" -> "xBSHWJ0FvhBV/Uego9xkgy0yKp+y1bp8o79y/XTHkPU=" # forces replacement
      ~ source_code_size            = 20750056 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_lambda_permission.LambdaEvent must be replaced
-/+ resource "aws_lambda_permission" "LambdaEvent" {
      ~ function_name      = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill" -> "ThrowTrashSkill" # forces replacement
      ~ id                 = "AllowExecutionFromAlexa" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket.PreferenceBucket must be replaced
-/+ resource "aws_s3_bucket" "PreferenceBucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1" -> (known after apply)
      ~ bucket                      = "throwtrash-skill-preference-ap-northeast-1" -> "throwtrash-skill-preference-prod" # forces replacement
      ~ bucket_domain_name          = "throwtrash-skill-preference-ap-northeast-1.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "throwtrash-skill-preference-ap-northeast-1.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "throwtrash-skill-preference-ap-northeast-1" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      ~ object_lock_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.RequestLogBucket must be replaced
-/+ resource "aws_s3_bucket" "RequestLogBucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1" -> (known after apply)
      ~ bucket                      = "throwtrash-skill-request-logs-ap-northeast-1" -> "throwtrash-skill-request-logs-prod" # forces replacement
      ~ bucket_domain_name          = "throwtrash-skill-request-logs-ap-northeast-1.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "throwtrash-skill-request-logs-ap-northeast-1.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "throwtrash-skill-request-logs-ap-northeast-1" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "app"   = "throwtrash"
            "group" = "skill"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "delete-expired-error-logs" -> null
          - prefix                                 = "error/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "delete-expired-request-logs" -> null
          - prefix                                 = "request/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ object_lock_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_acl.PreferenceBucketAcl will be destroyed
  # (because aws_s3_bucket_acl.PreferenceBucketAcl is not in configuration)
  - resource "aws_s3_bucket_acl" "PreferenceBucketAcl" {
      - acl                   = "private" -> null
      - bucket                = "throwtrash-skill-preference-ap-northeast-1" -> null
      - id                    = "throwtrash-skill-preference-ap-northeast-1,private" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "takahikoyamada2000" -> null
                  - id            = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "takahikoyamada2000" -> null
              - id           = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
            }
        }
    }

  # aws_s3_bucket_acl.RequestLogBucketAcl will be destroyed
  # (because aws_s3_bucket_acl.RequestLogBucketAcl is not in configuration)
  - resource "aws_s3_bucket_acl" "RequestLogBucketAcl" {
      - acl                   = "private" -> null
      - bucket                = "throwtrash-skill-request-logs-ap-northeast-1" -> null
      - id                    = "throwtrash-skill-request-logs-ap-northeast-1,private" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "takahikoyamada2000" -> null
                  - id            = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "takahikoyamada2000" -> null
              - id           = "5697f9211d68b8cf35ec703bd6f5b0964eadb0d6a811e3a627d0f1115cebb39e" -> null
            }
        }
    }

Plan: 8 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_6441a2cb-345c-4fc1-b172-233a148bdb48
stderr<<ghadelimiter_51d89b11-ddd2-4fd9-84c6-1793ea012021

ghadelimiter_51d89b11-ddd2-4fd9-84c6-1793ea012021
exitcode<<ghadelimiter_66a43052-79be-43e6-9c46-381e506080d9
0
ghadelimiter_66a43052-79be-43e6-9c46-381e506080d9 ```